app/Controllers/Produtos.php

    public function model()
    {
        $produto_model = new ProdutoModel();

        $dados = [
            'nome' => 'SmartPhone X20',
            'descricao'       => "Produto novo",
            'valor_de_compra' => 3199,
            'valor_de_venda'  => 3300,
            'quantidade'      => 10,
            'validade'        => '',
        ];

        $produto_model->where('id', 3)
                      ->set($dados)
                      ->update();
---
UPDATE `produtos` SET `nome` = 'SmartPhone X20', `descricao` = 'Produto novo', `valor_de_compra` = 3199, `valor_de_venda` = 3300, `quantidade` = 10, `validade` = '', `updated_at` = '2024-02-22 18:03:19'
WHERE `id` = 3